Revit 2027 API
Group.GroupType Property
Get or set the type of the group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual GroupType GroupType { get; set; }
Public Overridable Property GroupType As GroupType
	Get
	Set
public:
virtual property GroupType^ GroupType {
	GroupType^ get ();
	void set (GroupType^ value);
}
abstract GroupType : GroupType with get, set
override GroupType : GroupType with get, set
Property Value
GroupType
Remarks
By setting this property the group can be swapped to a different kind of group.
See Also
Reference
Group Class
Autodesk.Revit.DB Namespace